'use strict';

const a = prompt('Enter "a"');
const b = prompt('Enter "b"');
console.log(`Введене: 
a: ${a};
b: ${b};`);

// -------------------------------------CONDITION #1----------------------------------------------------

const outcome1 = +a === 0 ? "Вірно" : "Невірно";
    console.log (`Умова №1: "${a} === 0" // Результат: "${outcome1}";`);

// -------------------------------------CONDITION #2----------------------------------------------------

const outcome2 = +a > 0 ? "Вірно" : "Невірно";
    console.log (`Умова №2: "${a} > 0"   // Результат: "${outcome2}";`);

// -------------------------------------CONDITION #3----------------------------------------------------

const outcome3 = +a < 0 ? "Вірно" : "Невірно";
    console.log (`Умова №3: "${a} < 0"   // Результат: "${outcome3}";`);

// -------------------------------------CONDITION #4----------------------------------------------------

const outcome4 = +a >= 0 ? "Вірно" : "Невірно";
    console.log (`Умова №4: "${a} >= 0"  // Результат: "${outcome4}";`);

// -------------------------------------CONDITION #5----------------------------------------------------

const outcome5 = +a <= 0 ? "Вірно" : "Невірно";
    console.log (`Умова №5: "${a} <= 0"  // Результат: "${outcome5}";`);

// -------------------------------------CONDITION #6----------------------------------------------------

const outcome6 = +a !== 0 ? "Вірно" : "Невірно";
    console.log (`Умова №6: "${a} != 0"  // Результат: "${outcome6}";`);

// -------------------------------------CONDITION #7----------------------------------------------------

const outcome7 = a === 'test' ? "Вірно" : "Невірно";
    console.log (`Умова №7: "${a} === 'test'"  // Результат: "${outcome7}";`);

// -------------------------------------CONDITION #8----------------------------------------------------

const outcome8 = a === '1' ? "Вірно" : "Невірно";
    console.log (`Умова №8: "${a} === '1'"  // Результат: "${outcome8}";`);

// -------------------------------------CONDITION #9----------------------------------------------------

const outcome9 = a > 0 && a < 5   ?   "Вірно" : "Невірно";
console.log (`Умова №9: "0 < ${a} < 5"   // Результат: "${outcome9}";`);

// -------------------------------------CONDITION #9 with SWITCH----------------------------------------------------

switch (a > 0 && a < 5) {
    case true :
        console.log (`Умова №9 (switch): "0 < ${a} < 5"  // Результат: "Вірно";`);
        break;
        default:
            console.log (`Умова №9 (switch): "0 < ${a} < 5"  // Результат: "Невірно";`);
}

// -------------------------------------CONDITION #10----------------------------------------------------

let outcome10 = null;

if (+a === 0 || +a === 2) {
    outcome10 = +a + 7;
}else {
    outcome10 = +a / 10;
    }
console.log (`Умова №10:    // Результат: "${outcome10}";`);

// -------------------------------------CONDITION #11----------------------------------------------------

let outcome11 = null;

if (+a <= 1 && +b >= 3) {
    outcome11 = Number(a) + Number(b) ;
}else {
    outcome11 = Number(a) - Number(b) ;
}
console.log (`Умова №11:    // Результат: "${outcome11}";`);

// -------------------------------------CONDITION #12----------------------------------------------------

let outcome12 = null;

if ((+a > 2 && +a < 11) || (+b >= 6 && +b < 14)) {
    console.log (`Умова №12:    // Результат: "Вірно";`);
}else {
    console.log (`Умова №12:    // Результат: "Невірно";`);
}

// -------------------------------------CONDITION #13----------------------------------------------------

const num = +a;
let result = null;

switch (num) {
    case 1:
        result = "Зима";
        break;
    case 2:
        result = "Весна";
        break;
    case 3:
        result = "Літо";
        break;
    case 4:
        result ="Осінь";
        break;
    default:
        result = "Не вірне значення";
}
console.log (`Умова №13:    // Результат: ${result};`);